Revit 2025 API
PipeFlowConfigurationType Enumeration
 An enumerated type listing all connector flow configuration
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum PipeFlowConfigurationType
Public Enumeration PipeFlowConfigurationType
public enum class PipeFlowConfigurationType
type PipeFlowConfigurationType
Members
Member name | Value | Description
Calculated | 0 |  Flow configuration is calculated
Preset | 1 |  Flow configuration is Preset
System | 2 |  Flow configuration depends on system
Demand | 3 |  Flow configuration depends on demand
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace